Osmax-Br/time_keeper_esp32/main.cpp
}
String pause_web_var(){
  if(wifi_set_mode == false){
  if(paused == true){
    if(data_storage[current_page][data_storage_index][0] == 0 && data_storage[current_page][data_storage_index][1] && data_storage[current_page][data_storage_index][2]){
      return "Start";}
    else{  
    return "Resume";}
  }
  else if(paused == false ){
    return "Pause";
  }}
  else if(wifi_set_mode == true){
if(ssid_set == true && password_set == false){
    return "SSID";
 } 
if(ssid_set == false &&password_set == true){
  return "Password";
 }}
 
}
String var_processor(const String& var){
  if(var == "Timer"){
    return timer_web_var();
  }
  else if(var == "Chosen_server"){
    return chosen_value_web_var();
    }
  else if(var == "Pause"){
    return pause_web_var();
    }  
  return String();
}
//**************************************************************
//multi-tasking
TaskHandle_t ntp_time;  // getting the tine from internet 
TaskHandle_t buzzer_tone;

//************************************************************
// sql vars
//String sql_server_string = "http://192.168.1.11/esp32sql/data_base_script.php"; 
const char* sql_server = "http://192.168.1.9/esp32sql/data_base_script.php"; 



//********************************************************
//drop screen vars

//the name of options
String options_list[4][4] = {{"End day&upload","change Time zone","server off-on","chose temp unit"},{"ssid & password","IR settings","server's ip","screen turn off"},{"alarm","email","reset activity","test rgb"},{"Reset All","internal temp","buzzer settings","Contanct me"}};
int scroll_bar_place = 1; // for moving the cursor
int options_outer_counter = 0;  // counting the pages
int block_cursor = 0; // conuting the inner values inside page
int options_select_mode = 0 ; // the main var in drop screen , defines the current option selected
// 0 = menu , 1 = end&upload ....etc

int get_date_cursor = 0 ; // 0 right , 1 left
bool got_the_date_from_db = false ; // not being used
String current_get_day_and_month ;  // temp for storing date (not being used)




//******************************************************
//rgb led vars
#define PIN_RED    15 // GPIO23
#define PIN_GREEN  25 // GPIO22
#define PIN_BLUE   12 // GPIO21
//                       red 0      green 1   blue2     yellow 3    cyan 4      maginta 5   pink 6     off 7
int rgb_values[15][3] = {{255,0,0},{0,255,0},{0,0,255},{250,100,3},{7,245,201},{180,7,245},{245,7,75},{0,0,0}};
String rgb_values_name[15] = {"Red","Green","Blue","Yellow","Cyan","Maginta","Pink","Off"}; //this is for test rgb option
int current_rgb = 0;  // this is for test rgb option


//***************************************************
// prefrences vars
Preferences saves;

//***************************************************
//buzzer vars
int buzzerpin = 23;
String buzzer_tone_select = "" ;
int one_time_short_interval = 10 ;
int one_time_long_interval = 25 ;
int error_interval = 100 ;
bool buzzer_always_on = true;
bool buzzer_error_sound = true;
bool buzzer_pause_sound = true;
bool buzzer_press_sound = true;
int buzzer_settings_cursor = 0;





//internal temp sensor vars
#ifdef __cplusplus

extern "C" {

#endif

uint8_t temprature_sens_read();

#ifdef __cplusplus

}

#endif

uint8_t temprature_sens_read();




// should put it once
void rgb_display(int rgb_value_index){  // we did 255 - valie because the led is common annode ==> 0 = on  , 1 = off
    analogWrite(PIN_RED,255 - rgb_values[rgb_value_index][0]);
    analogWrite(PIN_GREEN,255 - rgb_values[rgb_value_index][1]);
    analogWrite(PIN_BLUE,255 - rgb_values[rgb_value_index][2]);

}

void buzzer_tone_function(void * pvParameters){ //buzzer tone
    for(;;) {
//void resume_tone(int buzzerpin){
  if(buzzer_tone_select == "resume" && buzzer_always_on == true && buzzer_pause_sound == true){
  int buzzerState = LOW;             // ledState used to set the LED
  unsigned long previousMillis = 0;
  const long interval = 80;
  for(int i =0 ; i<4 ;){
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (buzzerState == LOW) {
      buzzerState = HIGH;
    } else {
      buzzerState = LOW;}
    digitalWrite(buzzerpin, buzzerState);
    i++;}
    }
    buzzer_tone_select = "";
  }
/////////////////////////////////////
//void pause_tone(int buzzerpin){
  else if(buzzer_tone_select == "pause" && buzzer_always_on == true && buzzer_pause_sound == true){
  int buzzerState = 0;             // ledState used to set the LED
  unsigned long previousMillis = 0;
  const long interval = 220;
  for(int i = 0 ; i<2 ; ){
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (buzzerState == 0) {
      buzzerState = 1;
    } else {
      buzzerState = 0;}
      i++;
    digitalWrite(buzzerpin, buzzerState);}}
    buzzer_tone_select = "";
}



else if(buzzer_tone_select == "one_time_short" && buzzer_always_on == true && buzzer_press_sound == true){
  int buzzerState = 0;             // ledState used to set the LED
  unsigned long previousMillis = 0;
  const long interval = 10;
  for(int i = 0 ; i<2 ; ){
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (buzzerState == 0) {
      buzzerState = 1;
    } else {
      buzzerState = 0;}
      i++;
    digitalWrite(buzzerpin, buzzerState);}}
    buzzer_tone_select = "";
}

else if(buzzer_tone_select == "one_time_long" && buzzer_always_on == true && buzzer_press_sound == true){
  int buzzerState = 0;             // ledState used to set the LED
  unsigned long previousMillis = 0;
  const long interval = 25;
  for(int i = 0 ; i<2 ; ){
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (buzzerState == 0) {
      buzzerState = 1;
    } else {
      buzzerState = 0;}
      i++;
    digitalWrite(buzzerpin, buzzerState);}}
    buzzer_tone_select = "";
}
else if(buzzer_tone_select == "error" && buzzer_always_on == true && buzzer_error_sound == true){
  int buzzerState = 0;             // ledState used to set the LED
  unsigned long previousMillis = 0;
  const long interval = 50;
  for(int i = 0 ; i<20 ; ){
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval) {
    previousMillis = currentMillis;
    if (buzzerState == 0) {
      buzzerState = 1;
    } else {
      buzzerState = 0;}
      i++;
    digitalWrite(buzzerpin, buzzerState);}}
    buzzer_tone_select = "";
}





else{}




}} 



// must add last_time var
void post(int page , int activity , int day_of_upload , int month_of_upload , int year_of_upload) { // for pushing the data into the sqlite data base on the pc
// on pc I used wimp to host a server
 // http post
    if(WiFi.status()== WL_CONNECTED){ 
      HTTPClient http;
      
     // String s = sql_server;
      http.begin(sql_server);
      	
