Osmax-Br/time_keeper_esp32/main.cpp
for(int i=0 ; i<12 ; i++){
  int x1 = table[i][0];
  int y1 = table[i][1];
  if(x1==x && y==y1){
    
    chosen_value = str[current_page][i]; //the Actual selected value 
    data_storage_index = i ; //for knowing wher to store time data
    select_mode = 0;
    break;
  }
}

}

if(right == "long_pressed" && current_page != 3){ //for flipping pages and ensuring that an error doesnt happen
  current_page +=1 ;   // change page
}
if(left == "long_pressed" && current_page != 0){
  current_page -=1 ;   // change page 
}

print_label(current_page,cursor[0],cursor[1]); // printing the lables
}



void main_screen(){


 // rgb_display(7);
 display.clearDisplay();
 display.setTextColor(WHITE);
  display.setTextSize(1);
 //display.print("choice: ");
  if(chosen_value=="Nothing"){
    display.setCursor(45,53);
    display.print("Nothing");
    }
  else{
    display.setCursor(64 - chosen_value.length()*3,53);
    display.print(chosen_value);
    } 
  display.setFont(NULL);  
  display.setCursor(17,0+15);
  display.setTextSize(2);
  display.print(time_counter_string);
  display.setTextSize(1);
  display.setCursor(0,20+15);
  if(rtc_time_updated == true){
 display.print(rtc.getTime("%I:%M:%S %p %a %d/%m")); //printing current time from the rtc
  }
  else{
    display.print("Error! cant get time"); 
  }
 



 if(selecT == "pressed" && chosen_value=="Nothing" && millis() > last_press_time + 100){
    last_select_mode = select_mode;
    select_mode = 5;
    buzzer_tone_select = "error";
    error_message_text = "choose something";
    last_press_time = millis();
  }

  display.display();
}


void update_last_action(){ 
/* views when was the last time when pause/start pressed , have a dual action memory , doesnt register an action if the seperation
time is less than a minute
*/
// pause --> resume
if(last_action_register < 1000 && last_action_time[0] == 1 && last_action_time[1] == 0 && millis() < 10000){
  last_action_time[0] = 0; //fixing a problem where on startup shows 1:00
}
  if(last_action_is_pause==true && paused == true){
    if(last_action_register + 5000 < millis() || last_action_register < 1000){
    before_last_action_time[0] = last_action_time[0]; //dual memory saving
    before_last_action_time[1] = last_action_time[1];
    last_action_register = millis();
    }
    last_action_time[0] = rtc.getTime("%I").toInt();  //updating
    last_action_time[1] = rtc.getTime("%M").toInt();

    last_action_is_pause = false; 
    
  }
  else if(last_action_is_pause == false && paused == false){
    if(last_action_register + 5000 < millis() || last_action_register < 1000){
    before_last_action_time[0] = last_action_time[0];
    before_last_action_time[1] = last_action_time[1];
    last_action_register = millis();
    }
    last_action_time[0] = rtc.getTime("%I").toInt();
    last_action_time[1] = rtc.getTime("%M").toInt();
    last_action_is_pause = true;
    
  }
}

void screen_off(){
 
 if((right=="pressed" || left == "pressed" || up == "pressed" || down == "pressed" || selecT == "pressed")){  // wake the screen up
  //for not interfering with the grid selection
  display.ssd1306_command(SSD1306_DISPLAYON);
  if(select_mode == 3){
  select_mode = 0;    // back to main screen
  }
  last_time_screen_on = millis();
  }  
if(last_time_screen_on+saves_screen_off_time<millis() && time_critical == false){  // change the auto display_off time 
  select_mode = 3; // that means the screen is off
  display.ssd1306_command(SSD1306_DISPLAYOFF); // switch the display off
  options_select_mode = 0;
  }  
}


void counter_formatting(){
  
if(data_storage[current_page][data_storage_index][0] > 59){
  portENTER_CRITICAL(&timerMux);
  data_storage[current_page][data_storage_index][0] = 0;
  portEXIT_CRITICAL(&timerMux);
  data_storage[current_page][data_storage_index][1] ++ ;
}
if(data_storage[current_page][data_storage_index][1] == 59){
  data_storage[current_page][data_storage_index][1] = 0;
  data_storage[current_page][data_storage_index][2] ++ ;
}
sprintf(time_counter_string,"%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);

}

void last_action_screen(){
    display.clearDisplay();
    display.setCursor(33, 8);
    display.drawRoundRect(10, 0, 105, 35, 5, 1);
    display.setTextSize(2);
    display.printf("%02i:%02i",last_action_time[0],last_action_time[1]);
    display.setTextSize(1);
    display.setCursor(15, 25);
    if(paused == true){
    display.print("paused");}
    else{
      display.print("resume");
    }
    display.drawRoundRect(17, 40, 90, 24, 5, 1);
    display.setCursor(50, 45);
    display.printf("%02i:%02i",before_last_action_time[0],before_last_action_time[1]);
    display.setCursor(20, 52);
    if(last_action_is_pause == true){
    display.print("pause");}
    else{
      display.print("resume");
    }
    display.display();
}



void temp_screen(){
  display.clearDisplay();

  if(millis() > last_temp_update + 2000){
    humidity = dht.readHumidity();
    temperature = dht.readTemperature();
    heat_index = dht.computeHeatIndex(temperature, humidity, false);
    last_temp_update = millis();
}
if(temperature > -30 && temperature < 100){
    display.setCursor(0,0);
    display.setTextSize(1);
    display.print("TEMP  ");
    display.setTextSize(2);
    display.printf("%.01f C%c",temperature,(char)247);
    display.setCursor(0,25);
    display.setTextSize(1);
    display.print("HUMID  ");
    display.setTextSize(2);
    display.printf("%.01f %%",humidity);
    display.setCursor(0,50);
    display.setTextSize(1);
    display.print("INDEX ");
    display.setTextSize(2);
    display.printf("%.01f C%c",heat_index,(char)247);
    }
else{
    display.setCursor(0,0);
    display.setTextSize(1);
    display.print("TEMP  ");
    display.setTextSize(2);
    display.print("Error");
    display.setCursor(0,25);
    display.setTextSize(1);
    display.print("HUMID  ");
    display.setTextSize(2);
    display.print("Error");
    display.setCursor(0,50);
    display.setTextSize(1);
    display.print("INDEX ");
    display.setTextSize(2);
    display.print("Error");


