Osmax-Br/time_keeper_esp32/main.cpp
} 
if(ir_long_press == false){ 
    if(heat_index >= 30 ){
        rgb_display(0);
    }
    else{
        rgb_display(1);
    }}
    display.display();
}





String buzzer_on_off(bool state){
  if(state == true){
    return "On";
  }
  else if(state == false){
    return "Off";
  }

}


void buzzer_change_state(bool state,const char* key){
  if(state == true){
    //saves.putBool(key,false);
    
    state = false;
  }
  else if(state == false){
  //saves.putBool(key,true);
    state = true;
  }
}

//*******************************************************

void gmt_settings(){
if(time_partitioned == false){
    String gmt_offset_string = partition_time(gmt_offset);
    gmt_offset_minutes = gmt_offset_string.substring(3,5).toInt();
    gmt_offset_hours = gmt_offset_string.substring(0,2).toInt();
    time_partitioned = true;
    }
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("     GMT offset");
    display.setCursor(20, 15);
    display.setTextSize(3);
    display.printf("%02i:%02i",gmt_offset_hours,gmt_offset_minutes);
    if(up == "pressed"){
        if(ok_cancel_button == false && gmt_offset_hours < 12){  //change minutes
            gmt_offset_hours ++ ;
        }
        if(ok_cancel_button == true && gmt_offset_minutes <= 59){  //change minutes
            gmt_offset_minutes ++ ;
        }
        if(gmt_offset_minutes == 60){
          gmt_offset_minutes = 0;
          if(gmt_offset_hours < 12){
         gmt_offset_hours ++ ;}
        }
    }

    if(down == "pressed"){
        if(ok_cancel_button == true && gmt_offset_minutes > 0){  
            gmt_offset_minutes -- ;
        }
        if(ok_cancel_button == false && gmt_offset_hours > -12){  
            gmt_offset_hours -- ;
        }

    }    

    if(ok_cancel_button == false){
    display.drawLine(25, 40, 50, 40, 1);
    }
    else{
    display.drawLine(75, 40, 100, 40, 1);
    }
    display.setTextSize(1);
    display.drawRoundRect(42, 48, 40, 15, 5, 1);
    display.setCursor(57, 51);
    display.print("ok");
    display.display();
    
    
    
    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(selecT == "pressed" && millis() > last_press_time + 100){
        time_partitioned = false;
        gmt_offset = gmt_offset_hours*3600 + gmt_offset_minutes*60 ;
        rtc.offset = gmt_offset ;
        saves.putLong("gmt_offset",gmt_offset);
        last_press_time = millis();
        options_select_mode = 0;
    }
}

//*******************************************************************************************

void buzzer_settings(){
    if(up == "pressed" && buzzer_settings_cursor != 0){
    buzzer_settings_cursor --;
  }
  if(down == "pressed" && buzzer_settings_cursor != 3){
    buzzer_settings_cursor ++;
  }






    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 2);
    display.println("Buzzer always : ");



    if(buzzer_settings_cursor == 0){
    display.fillRoundRect(90, 0, 38, 12, 3, WHITE);
    display.setCursor(100, 2);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_always_on));}
    else{
    display.drawRoundRect(90, 0, 38, 12, 3, WHITE);
    display.setCursor(100, 2);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_always_on));
    }



    display.setTextColor(WHITE);
    display.setCursor(0, 17);
    display.print("error sound   :");




    if(buzzer_settings_cursor == 1){
    display.fillRoundRect(90, 15, 38, 12, 3, 1);
    display.setCursor(100, 17);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_error_sound));}
    else{
    display.drawRoundRect(90, 15, 38, 12, 3, 1);
    display.setCursor(100, 17);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_error_sound));
    }




    display.setTextColor(WHITE);
    display.setCursor(0, 32);
    display.print("pause/resume  :");


    if(buzzer_settings_cursor == 2){
    display.fillRoundRect(90, 30, 38, 12, 3, 1);
    display.setCursor(100, 32);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_pause_sound));
    }
    else{
    display.drawRoundRect(90, 30, 38, 12, 3, 1);
    display.setCursor(100, 32);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_pause_sound));
    }
    





    display.setTextColor(WHITE);
    display.setCursor(0, 47);
    display.print("press sound   :");



if(buzzer_settings_cursor == 3){
    display.fillRoundRect(90, 45, 38, 12, 3, 1);
    display.setCursor(100, 47);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_press_sound));
}
else{
    display.drawRoundRect(90, 45, 38, 12, 3, 1);
    display.setCursor(100, 47);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_press_sound));
}
    
if(left == "pressed" || right == "pressed"){
    if(buzzer_settings_cursor == 0){
       if(buzzer_always_on == true){
        buzzer_always_on = false;
        saves.putBool("b_always_on",false);
        }
        else if(buzzer_always_on == false){
          buzzer_always_on = true;
          saves.putBool("b_always_on",true);
        }
    }
    else if(buzzer_settings_cursor == 1){
       // buzzer_change_state(buzzer_error_sound,"b_error_sound");
       if(buzzer_error_sound == false){
        buzzer_error_sound = true;
       }
       else if(buzzer_error_sound == true){
        buzzer_error_sound = false;
       }
         saves.putBool("b_error_sound",buzzer_error_sound);
    }
    else if(buzzer_settings_cursor == 2){
       // buzzer_change_state(buzzer_pause_sound,"b_pause_sound");
        if(buzzer_pause_sound == false){
        buzzer_pause_sound = true;
       }
       else if(buzzer_pause_sound == true){
        buzzer_pause_sound = false;
       }
         saves.putBool("b_pause_sound",buzzer_pause_sound);
    }   
    else if(buzzer_settings_cursor == 3){
      if(buzzer_press_sound == false){
        buzzer_press_sound = true;
       }
       else if(buzzer_press_sound == true){
        buzzer_press_sound = false;
       }
       // buzzer_change_state(buzzer_press_sound,"b_press_sound");
        saves.putBool("b_press_sound",buzzer_press_sound);
    }       



