Osmax-Br/time_keeper_esp32/main.cpp
}    

    display.display();

}


//**********************************************************

void rgb_settings(){
    display.clearDisplay();
  if(select_mode == 4 && right == "pressed" && options_select_mode == 12 && current_rgb != 7){
   current_rgb ++;
}
if(select_mode == 4 && options_select_mode == 12 && left == "pressed" && current_rgb != 0){
   current_rgb --;
}
  rgb_display(current_rgb);
  display.setCursor(30,10);
  display.setTextColor(WHITE);
  display.setTextSize(2);
  display.print(rgb_values_name[current_rgb]);
  display.setCursor(15,40);
  display.setTextSize(1);
  display.printf("(%i ,  %i ,  %i)",rgb_values[current_rgb][0],rgb_values[current_rgb][1],rgb_values[current_rgb][2]);
  display.display();
}


//**************************************************



void select_and_upload_settings(){

  if(rtc_time_updated == false && millis() > last_press_time + 100){
    last_select_mode = select_mode;
    select_mode = 5;
    buzzer_tone_select = "error";
    error_message_text = "please update time";
    options_select_mode = 0;
    last_press_time = millis();
  }
    int day_of_upload = 1;
    int day_of_upload_1 = rtc.getTime("%d").toInt(); //the current real-time day (stored in a var to reduce cpu cycles)
    int day_of_upload_2 = rtc.getTime("%d").toInt() - 1 ; //the other day of upload
    int month_of_upload = rtc.getTime("%m").toInt(); //the current real-time month (stored in a var to reduce cpu cycles)
    int year_of_upload = rtc.getTime("%Y").toInt();
    display.setTextColor(WHITE,BLACK);  //for not transperant bg
    bool done_uploading = false;  // flag to leave the upload menu
    time_critical = true ;  // flag to not turn off the screen while uploading
    //this is for calculating the previous day when the day is 1 (1 - 1 = 0 that's wrong)
    if(day_of_upload_1 == 1){
      if(month_of_upload == 5 || month_of_upload == 7 || month_of_upload == 10 || month_of_upload == 12){
        day_of_upload_2 = 30 ;  //months with 31 days
        month_of_upload -- ;  // change month
      }
      else if(month_of_upload == 3){  //february
        if( ((rtc.getTime("%Y").toInt()%4 == 0) && (rtc.getTime("%Y").toInt() % 100 != 0) ) || rtc.getTime("%Y").toInt() % 400 == 0){ //test if the year is a leap year
          day_of_upload_2 = 29; // leap
          month_of_upload -- ;  // change month
        }
        else{
          day_of_upload_2 = 28; //normal
          month_of_upload -- ;  // change month
        }
      }
      else{
        day_of_upload_2 = 31 ;  //months that are 30 days
        if(month_of_upload == 1){
          year_of_upload -- ;
          month_of_upload = 12;
        }
        else{
        month_of_upload -- ;  // change month 
        }
      }
    }





   //*********************
    bool chose_date = false;    // for navigating between the choosing menu and the actual upload menu
    if(chose_date == false){    // ****the choosing menu****
      display.clearDisplay();
      //not useful
     //  int current_get_day_of_month = current_get_day_and_month.substring(0,current_get_day_and_month.indexOf(",")).toInt();   
      // int current_get_month = current_get_day_and_month.substring(current_get_day_and_month.indexOf(",")+1,current_get_day_and_month.length()).toInt();
      //////////////////
      display.setCursor(5,0);
      display.setTextSize(2);
      display.print("Select Day");
      display.setCursor(35,20);
      display.setTextSize(1);
      display.print("of upload");
      //right set

      display.setTextSize(2);
      display.setCursor(5,40);
      display.print(rtc.getTime("%d")); //current day from rtc
      display.setTextSize(1);
      display.setCursor(30,45);
      display.print("/");
      display.print(rtc.getTime("%02m"));


      display.setTextSize(2);
      display.setCursor(75,40);
      char temp_day_char_storage[30]; // just temp var for formatting
      sprintf(temp_day_char_storage,"%02i" ,day_of_upload_2); // format the printing message
      display.print(temp_day_char_storage);
      display.setTextSize(1);
      display.setCursor(100,45);
      display.print("/");
      char temp_month_print[30];
      sprintf(temp_month_print,"%02i",month_of_upload);
      display.print(temp_month_print);
      if(right == "pressed" && get_date_cursor == 0){ //change the chosen date
      get_date_cursor = 1;
      }
      else if(left == "pressed" && get_date_cursor == 1){
         get_date_cursor = 0;
     }

      if(get_date_cursor == 0){ // draw the line accordingly
         display.drawLine(10,60,40,60,WHITE);
      }
      else if(get_date_cursor == 1){
        display.drawLine(80,60,110,60,WHITE);
      }
      
        if(get_date_cursor == 0){ // set the day of upload
          day_of_upload = day_of_upload_1;  //right (rtc day)
        }
        else if(get_date_cursor == 1){
          day_of_upload = day_of_upload_2; //left (rtc day -1)
        }
        
      if(selecT == "pressed" && millis() > last_press_time + 100 ){ //switch to uplaod screen

          last_press_time = millis();
          chose_date = true ; //choosed the date
      }

      /////////////////
      
    }
// **** uploading screen ****
    if(chose_date == true){ //if the date is chosen from the last screen
    display.clearDisplay();
    display.setCursor(5,0);
    display.setTextSize(2);
    display.print("END OF DAY");
    display.setTextSize(1);
    display.setCursor(0,20);
    display.print("Server: ");
    display.print(String(sql_server).substring(7,19)); //the ip address of server
     display.setCursor(20,35);
     display.print("the day : ");
     char temp_date_print[30];
     sprintf(temp_date_print,"%02i/%02i",day_of_upload,month_of_upload);
     display.print(temp_date_print);  // the chosen date of upload (from last screen)
     int activity_print_counter = 0;  // for printing the progress bar on screen
    rgb_display(5);
    paused = true;
    buzzer_tone_select = "pause";
    for(int i = 0; i<4 ; i++){  // 4 pages
      for(int j =0 ; j<12 ; j++){ // 12 activities
          post(i,j,day_of_upload,month_of_upload,year_of_upload);      // the actual post function
          display.setCursor(20,55);
         char uplaod_progress_message[20] = ""; // dont know why !
         display.print("uploaded ");
         display.print(activity_print_counter); // progress bar
         display.print("/52");
          display.print(uplaod_progress_message);
          display.display();
          activity_print_counter ++ ; // increase the activity counter
      }
    }
    done_uploading = true; // finished uploading (exit screen)
    portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
    memset(data_storage, 0, sizeof(data_storage));
    portEXIT_CRITICAL_ISR(&timerMux);
    display.display();
    
   if((selecT == "pressed" && millis() > last_press_time + 2000) || done_uploading == true){  // either the process is aborted or it finished
    //got_the_date_from_db = false;
    time_critical = false ; // you can turn the screen off
    options_select_mode = 0;  // go to options menu
    last_press_time = millis();
  }}
  
  
