Osmax-Br/time_keeper_esp32/main.cpp
}


//***********************************************************************************
void activity_reset_settings(){

      display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("do you want to reset?");
    display.setCursor(23, 15);
    display.setFont(&FreeMonoBoldOblique9pt7b);
    display.print(chosen_value);
    display.setFont(&FreeMono9pt7b);
    display.setCursor(20, 40);
    display.printf("%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);
    display.setFont(NULL);
    if(ok_cancel_button == false){
    display.fillRoundRect(20, 45, 40, 15, 3, WHITE);
    display.setCursor(23, 48);
    display.setTextColor(BLACK);
    display.print("Cancel");
    display.setTextColor(WHITE);
    display.drawRoundRect(70, 45, 40, 15, 3, 1);
    display.setCursor(84, 48);
    display.print("ok");}
    else if(ok_cancel_button == true){
    display.drawRoundRect(20, 45, 40, 15, 3, 1);
    display.setCursor(23, 48);
    display.setTextColor(WHITE);
    display.print("Cancel");
    display.fillRoundRect(70, 45, 40, 15, 3,WHITE);
    display.setCursor(84, 48);
    display.setTextColor(BLACK);
    display.print("ok");
    }




    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(ok_cancel_button == false && selecT == "pressed" && millis() > last_press_time + 100){
      ok_cancel_button = true;
      last_press_time = millis();
      options_select_mode = 0;
    }
    else if(ok_cancel_button == true && selecT == "pressed"&& millis() > last_press_time + 100){
      if(chosen_value == "Nothing"){
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "choose an activity";
          buzzer_tone_select = "error";
          options_select_mode = 11;
          last_press_time = millis();
      }
      else{
       portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
       data_storage[current_page][data_storage_index][0] = 0 ;
       data_storage[current_page][data_storage_index][1] = 0 ;
       data_storage[current_page][data_storage_index][2] = 0 ;
       portEXIT_CRITICAL_ISR(&timerMux);
       paused = true ;
       buzzer_tone_select = "pause";
       last_press_time = millis();
       options_select_mode = 0;
      }

    }


    display.display();
}

//***************************************************************************

void esp32_internal_temp_settings(){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("Esp 32 internal temp");
    display.setCursor(0, 20);
    display.setTextSize(3);
    display.printf("%.01f C%c",(temprature_sens_read() - 32)/1.8,(char)247);
    display.display();
}

//***********************************************************************************************

void settings_menu_navigation(){

  display.setTextSize(1);
  // rect loop
  for(int i =0 ;i<=4 ; i++){
    if(i==block_cursor){  // fill the rect white when cursor passes
      display.fillRect(0,16*i,110,16,WHITE);
    }
    else{
      display.drawRect(0,16*i,110,16,WHITE);}
      }
  int options_inner_counter = 0;   // internal var only , for inverting text color
  //text loop
  for(int i=5;i<=50;i+=15){
     display.setCursor(9,i+1);
     if(options_inner_counter == block_cursor){ //when cursor passes make rect text black
      display.setTextColor(BLACK);
     }
     else{
      display.setTextColor(WHITE);  // inverting text
     }
    display.print(options_list[options_outer_counter][options_inner_counter]);  // print option labels
    options_inner_counter++;  // print next label inside the same page
    }
  
  
  for(int i=0 ; i <=64 ; i+=8){   // the dots
    display.fillRect(122,i,2,2,WHITE);
          }
// move up
  if(up == "pressed"){
    if(options_outer_counter + block_cursor != 0){  //for not going outside the screen
    block_cursor --;}// move up


    if(block_cursor == -1  && scroll_bar_place !=1){  // change page
      block_cursor = 3; //the last option of the previous page
    scroll_bar_place -= 10; // change the scroll_bar
    options_outer_counter--;} // change page
  }

// move down (same way)
  if(down == "pressed"){
    if(options_outer_counter == 3 && block_cursor ==3){

    }
    else{
    block_cursor ++ ;}
    if(block_cursor == 4  && scroll_bar_place != 31 && options_outer_counter != 4){
      block_cursor = 0;
    scroll_bar_place += 10; 
    options_outer_counter++;}
  }
  display.fillRoundRect(120,scroll_bar_place,5,20,5,WHITE); // print the actual scroll bar
  
 
  if(selecT == "pressed" && options_select_mode == 0){ //entering the first option
    int option_counter_temp = 0;
    option_counter_temp = options_outer_counter*4;
    option_counter_temp += block_cursor ;
    option_counter_temp++ ;
    last_press_time = millis(); // for not regestring multiple presses
    options_select_mode = option_counter_temp;
}}


//**************************************************************************************

void screen_off_settings(){
      if(time_partitioned == false){
    String screen_off_time_string = partition_time(saves_screen_off_time/1000);
    screen_off_seconds = screen_off_time_string.substring(6,8).toInt();
    screen_off_minutes = screen_off_time_string.substring(3,5).toInt();
    time_partitioned = true;
    }
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("   screen off time");
    display.setCursor(20, 15);
    display.setTextSize(3);
    display.printf("%02i:%02i",screen_off_minutes,screen_off_seconds);
    if(up == "pressed"){
        if(ok_cancel_button == false && screen_off_minutes < 3){  //change minutes
            screen_off_minutes ++ ;
        }
        if(ok_cancel_button == true && screen_off_minutes <= 59){  //change minutes
            screen_off_seconds ++ ;
        }
        if(screen_off_seconds == 60){
          screen_off_seconds = 0;
          if(screen_off_minutes < 3){
          screen_off_minutes ++ ;}
        }
    }

    if(down == "pressed"){
        if(ok_cancel_button == false && screen_off_minutes > 0){  //change minutes
            screen_off_minutes -- ;
        }
        if(ok_cancel_button == true && screen_off_seconds > 0){  //change minutes
            screen_off_seconds -- ;
        }

