Osmax-Br/time_keeper_esp32/main.cpp
    }    

    if(ok_cancel_button == false){
    display.drawLine(25, 40, 50, 40, 1);
    }
    else{
    display.drawLine(75, 40, 100, 40, 1);
    }
    display.setTextSize(1);
    display.drawRoundRect(42, 48, 40, 15, 5, 1);
    display.setCursor(57, 51);
    display.print("ok");
    display.display();
    
    
    
    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(selecT == "pressed" && millis() > last_press_time + 100){
        saves_screen_off_time = ((screen_off_minutes*60) + screen_off_seconds)*1000;
        if(saves_screen_off_time < 5000){
            saves_screen_off_time = 30000;
            last_select_mode = select_mode;
            select_mode = 5;
            error_message_text = "minimum value is \n      5 seconds !";
            buzzer_tone_select = "error";
            options_select_mode = 0;
            last_press_time = millis();
            time_partitioned = false;
        }
        else if(saves_screen_off_time >= 5000){
        saves.putUInt("screen_off_time",saves_screen_off_time);
        last_press_time = millis();
        time_partitioned = false;
        options_select_mode = 0;}
    }
}

//************************************************************************




void drop_screen(){
  if(options_select_mode == 0){ // main options menu
    settings_menu_navigation();
  } 

// first option menu (end & upload)
  if(options_select_mode == 1){ //first menu + updated date
    select_and_upload_settings();
  }

if(options_select_mode == 12){
 rgb_settings();
}


if(options_select_mode == 11){
  activity_reset_settings();
}

if(options_select_mode == 2){
    gmt_settings();
}



if(options_select_mode == 8){
  screen_off_settings();
}



if(options_select_mode == 14){
  esp32_internal_temp_settings();
}

if(options_select_mode == 15){
  buzzer_settings();
}



if(options_select_mode == 5){
    wifi_set_mode = true;
    time_critical = true;
    //WiFi.begin("esp32", "123456789");
    if(WiFi.status() == WL_CONNECTED){
      Serial.print("connecteed");
    }
    if(wifi_page == 0){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.print("Set wifi credentials");
    display.setCursor(0, 10);
    display.print("host wifi on phone");
    display.setCursor(0, 25);
    display.print("SSID : esp32");
    display.setCursor(0, 38);
    display.print("Pass : 123456789");

    
    
    
    }
    else if(wifi_page == 1){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("connect via browser :");
    display.setCursor(0, 15);
    display.print("IP : ");
    display.print(WiFi.localIP());
    display.setCursor(0, 27);
    display.print("Then type ssid and \npress submit ONLY");
    
    }
    else if(wifi_page == 2){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(2);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("wifi saved");
    display.setCursor(0, 15);
    display.setTextSize(1);
    display.println("now you can connect\nto the network and \nconnect to \n   ip:129.168.1.199");
   
    }
    
    if(selecT == "pressed" && wifi_page == 2){
      display.clearDisplay();
    ssid_set = true;
    password_set = false;
    wifi_set_mode = false;

    WiFi.disconnect();
    connect_wifi();
    options_select_mode = 0;
    select_mode = 0;
    } 
        
 if(wifi_page!=2){      
        if(ok_cancel_button == false){
    display.fillRoundRect(20, 48, 40, 15, 3, WHITE);
    display.setCursor(26, 51);
    display.setTextColor(BLACK);
    display.print("Back");
    display.setTextColor(WHITE);
    display.drawRoundRect(70, 48, 40, 15, 3, 1);
    display.setCursor(79, 51);
    display.print("Next");}
    else if(ok_cancel_button == true){
    display.drawRoundRect(20, 48, 40, 15, 3, 1);
    display.setCursor(26, 51);
    display.setTextColor(WHITE);
    display.print("Back");
    display.fillRoundRect(70, 48, 40, 15, 3,WHITE);
    display.setCursor(79, 51);
    display.setTextColor(BLACK);
    display.print("Next");
    }}
    else if(wifi_page == 2){
      display.drawRoundRect(40,50,50,13,1,WHITE); 
      display.setCursor(60,52);
      display.print("ok");
    }




    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

if(selecT == "pressed" && millis() > last_press_time + 100){
  if(ok_cancel_button == true && wifi_page != 1){
      wifi_page ++;
  }
  else if (ok_cancel_button == false && wifi_page != 0){
    wifi_page --;
  }
  last_press_time = millis();
}
    
if(password_set == true){
  wifi_page = 2;
}    

  if(up == "long_pressed" ){
    ssid_set = true;
    password_set = false;
    wifi_set_mode = false;

    WiFi.disconnect();
    connect_wifi();
    options_select_mode = 0;
    select_mode = 0;
  }






  display.display(); 
}


if(options_select_mode >= 2 && options_select_mode != 12 && options_select_mode != 11 && options_select_mode != 8 && options_select_mode!= 2 && options_select_mode!= 14  && options_select_mode != 15){
    last_select_mode = select_mode;
    select_mode = 5;
    error_message_text = "not done yet";
    buzzer_tone_select = "error";
    options_select_mode = 0;
    last_press_time = millis();
}




}

















void setup() {
  
  sprintf(time_counter_string,"%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);  // for initilizing the counter string

